Функция КурсВалюты(Валюта, Период) Экспорт 
	
	Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда
		Возврат 1;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Курс;
	КонецЕсли;
	
	ВызватьИсключение("Курс валюты не задан.");
	
КонецФункции
